Autodesk.Revit.DB.ParameterValue.IsSameType(Autodesk.Revit.DB.ParameterValue)
Tests another instance is of the same value type.
other:
The instance to compare with
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.ParameterValue.IsEqual(Autodesk.Revit.DB.ParameterValue)
Tests equality with another instance of the same class.
Remarks:
The result is always False if the two comparands are of a different value types.
other:
The instance to compare with
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.ParameterValue.Copy
Makes an identical copy of the given parameter value.
Since:
2016 Subscription Update

Autodesk.Revit.DB.ParameterValue.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ParameterValue
A class that holds a value of a parameter element.
Remarks:
This is a non-instantiable base class.
Classes that actually store a value of a certain type are all
derived from this base class, once class per each value type.
Since:
2016 Subscription Update